## Time Methods
Date time is very important in DataFrame.

In [45]:
from datetime import datetime as dt
import pandas as pd
import numpy as np
import warnings

# To ignore all warnings
warnings.filterwarnings("ignore")

In [46]:
myser = pd.Series(['Nov 3, 2000', '2000-01-01', None])
myser

0    Nov 3, 2000
1     2000-01-01
2           None
dtype: object

In [47]:
#this is object type
myser[1]

'2000-01-01'

In [48]:
pd.to_datetime(myser)

0   2000-11-03
1   2000-01-01
2          NaT
dtype: datetime64[ns]

In [49]:
#if the date is in another format but it automatically changes it to this format
prev_time = '21-10-2024'
pd.to_datetime(prev_time)

Timestamp('2024-10-21 00:00:00')

In [50]:
pd.to_datetime(prev_time,dayfirst=True)

Timestamp('2024-10-21 00:00:00')

### Custom Time String Formatting

In [51]:
rand_date = '21--Oct--2000'

In [52]:
pd.to_datetime(rand_date,format = '%d--%b--%Y')

Timestamp('2000-10-21 00:00:00')

In [53]:
strange_date = '12th of Dec 2000'

In [54]:
pd.to_datetime(strange_date)

Timestamp('2000-12-12 00:00:00')

In [55]:
df = pd.read_csv(r'/home/mustahid34/Downloads/RetailSales_BeerWineLiquor.csv')

In [56]:
df.head()

         DATE  MRTSSM4453USN
0  1992-01-01           1509
1  1992-02-01           1541
2  1992-03-01           1597
3  1992-04-01           1675
4  1992-05-01           1822

In [57]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 340 entries, 0 to 339
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   DATE           340 non-null    object
 1   MRTSSM4453USN  340 non-null    int64
dtypes: int64(1), object(1)
memory usage: 5.4+ KB

In [58]:
#here Date is in object format. 
#so we should convert it in date format. It will help next 
df['DATE'] = pd.to_datetime(df['DATE'])

In [59]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 340 entries, 0 to 339
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   DATE           340 non-null    datetime64[ns]
 1   MRTSSM4453USN  340 non-null    int64
dtypes: datetime64[ns](1), int64(1)
memory usage: 5.4 KB

In [60]:
df.shape

(340, 2)

In [61]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 340 entries, 0 to 339
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   DATE           340 non-null    datetime64[ns]
 1   MRTSSM4453USN  340 non-null    int64
dtypes: datetime64[ns](1), int64(1)
memory usage: 5.4 KB

In [62]:
df.set_index('DATE',inplace = True)

In [63]:
df

            MRTSSM4453USN
DATE
1992-01-01           1509
1992-02-01           1541
1992-03-01           1597
1992-04-01           1675
1992-05-01           1822
...                   ...
2019-12-01           6630
2020-01-01           4388
2020-02-01           4533
2020-03-01           5562
2020-04-01           5207

[340 rows x 1 columns]

In [69]:
df.resample(rule = 'A').mean()

            MRTSSM4453USN
DATE
1992-12-31    1807.250000
1993-12-31    1794.833333
1994-12-31    1841.750000
1995-12-31    1833.916667
1996-12-31    1929.750000
1997-12-31    2006.750000
1998-12-31    2115.166667
1999-12-31    2206.333333
2000-12-31    2375.583333
2001-12-31    2468.416667
2002-12-31    2491.166667
2003-12-31    2539.083333
2004-12-31    2682.416667
2005-12-31    2797.250000
2006-12-31    3001.333333
2007-12-31    3177.333333
2008-12-31    3292.000000
2009-12-31    3353.750000
2010-12-31    3450.083333
2011-12-31    3532.666667
2012-12-31    3697.083333
2013-12-31    3839.666667
2014-12-31    4023.833333
2015-12-31    4212.500000
2016-12-31    4434.416667
2017-12-31    4602.666667
2018-12-31    4830.666667
2019-12-31    4972.750000
2020-12-31    4922.500000

In [70]:
df.reset_index()

          DATE  MRTSSM4453USN
0   1992-01-01           1509
1   1992-02-01           1541
2   1992-03-01           1597
3   1992-04-01           1675
4   1992-05-01           1822
..         ...            ...
335 2019-12-01           6630
336 2020-01-01           4388
337 2020-02-01           4533
338 2020-03-01           5562
339 2020-04-01           5207

[340 rows x 2 columns]

In [73]:
df = pd.read_csv(r'/home/mustahid34/Downloads/RetailSales_BeerWineLiquor.csv')

In [74]:
df.head()

         DATE  MRTSSM4453USN
0  1992-01-01           1509
1  1992-02-01           1541
2  1992-03-01           1597
3  1992-04-01           1675
4  1992-05-01           1822

In [75]:
df['DATE'] = pd.to_datetime(df['DATE'])

In [77]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 340 entries, 0 to 339
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   DATE           340 non-null    datetime64[ns]
 1   MRTSSM4453USN  340 non-null    int64
dtypes: datetime64[ns](1), int64(1)
memory usage: 5.4 KB

In [81]:
df[df['DATE'].dt.is_leap_year]

          DATE  MRTSSM4453USN
0   1992-01-01           1509
1   1992-02-01           1541
2   1992-03-01           1597
3   1992-04-01           1675
4   1992-05-01           1822
..         ...            ...
299 2016-12-01           6057
336 2020-01-01           4388
337 2020-02-01           4533
338 2020-03-01           5562
339 2020-04-01           5207

[88 rows x 2 columns]

In [82]:
df['DATE'].dt.month

0       1
1       2
2       3
3       4
4       5
       ..
335    12
336     1
337     2
338     3
339     4
Name: DATE, Length: 340, dtype: int64